---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceLoadData.LoadStatus
source: html/de123ee9-c5c1-f23b-0c82-01ae794547da.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.LoadStatus Property

The success or failure status of the load attempt.

## Syntax (C#)
```csharp
public ExternalResourceLoadStatus LoadStatus { get; }
```